#include <stdio.h>
#include <stdlib.h> 
int decToBinary(int n)
{
    if (n > 0){
        decToBinary(n >> 1) ; // สมมติ n = 10(1010) จะวนจนกว่า  n > 0 พอวนเจอที่ n > 0 แล้ว จะ่ทำการ ค่อยๆกลับออกไปที่ละชั้น 
        printf("%d", n & 1); // กลับไปรอบที่ 1 ,n = 1 ดังนั้น n(1(0001)) & 1(0001) จะได้ 1 ออกมาเป็นตัวแรก
                            // รอบที่ 2 ,n = 2 ดังนั้น n(3(0010)) & 1(0001) จะได้ 0 ออกมาเป็นตัวที่ 2
                           //  รอบที่ 3 ,n = 5 ดังนั้น n(5(0101)) & 1(0001) จะได้ 1 ออกมาเป็นตัวที่ 3
                          //   รอบที่ 4 ,n = 10 ดังนั้น n(10(1010)) & 1(0001) จะได้ 0 ออกมาเป็นตัวที่ 4
                         //    เรียกง่ายๆว่า ไปให้สุดแล้วค่อยๆทำมันออกมา
    }
}
int main()
{
    char num[1000] ;
    fgets(num , 1000 , stdin);
    int numd = atoi(num);
    if(numd == 0){
        printf("0");
    }
    else {
        decToBinary(numd);
    }
    return 0;
}